# User role controlled by request parameter

**Платформа:** PortSwigger Web Security Academy  
**Категория:** Web / Access Control  
**Уровень:** Apprentice  
**Дата:** 14.10.2026
**Статус:** ✅ Solved  
**Ссылка:** https://0af000ae046dd2e480acbcb2005700a6.web-security-academy.net/

---

## 1. Objective
Удалить пользователя 'carlos' через панель администратора, которая проверяет роль пользователя через Cookie

## 2. Reconnaissance
- Проверил robots.txt - отсутсвует
- Проверил /admin - реально сущетсвует, но доступ к ней закрыт
- Могу залогиниться с помощью данных в условии логина и пароля wiener:peter

## 3. Exploitation
1. Залогинился на сайте под wiener:peter
2. Через панель Burp Suite Proxy с Intercept On зашел на /admin
3. В intercepted запросе в панели Request в строке Cookie изменил параметр с admin=False на admin=True и получил доступ к админ-панели
4. Получив доступ к панели удалил пользователя carlos таким же методом - изменив параметр куки в запросе

**Payload:**
```text
Cookie: Admin=false → Cookie: Admin=true
```

**Почему это сработало:**  
Разработчики оставили параметр проверяющий роль пользователя в Cookie HTTP-запроса, который легко перехватить и переделать

## 4. Result
Доступ к админ-панели получен, пользователь удален, лаба решена

## 5. Key Takeaway & Remediation

**Что я узнал:**  
Хранить флаг роли пользователя в Cookie - плохая практика, так как Cookie легко подделывается на стороне клиента.

**Как защитить:**
1. Реализовать server-side валидацию: при каждом запросе к /admin сервер должен проверять роль пользователя в своей базе данных или сессии, а не верить значению Cookie
